args@{
  lib,
  pkgs,
  pkgs-unstable,
  funcs,
  helpers,
  defs,
  self,
  ...
}:
{
  name = "startify";

  group = "nvim-modules";
  input = "common";

  module = {
    home = config: {
      programs.nixvim.plugins.startify = {
        enable = true;
        settings = {
          custom_header = [
            ""
            ""
            "       ◢██◣   ◥███◣  ◢██◣"
            "       ◥███◣   ◥███◣◢███◤"
            "        ◥███◣   ◥██████◤"
            "    ◢█████████████████◤   ◢◣"
            "   ◢██████████████████◣  ◢██◣"
            "        ◢███◤      ◥███◣◢███◤"
            "       ◢███◤        ◥██████◤"
            "◢█████████◤          ◥█████████◣"
            "◥█████████◣          ◢█████████◤"
            "    ◢██████◣        ◢███◤"
            "   ◢███◤◥███◣      ◢███◤"
            "   ◥██◤  ◥██████████████████◤"
            "    ◥◤   ◢█████████████████◤"
            "        ◢██████◣   ◥███◣"
            "       ◢███◤◥███◣   ◥███◣"
            "       ◥██◤  ◥███◣   ◥██◤"
            ""
          ];
          change_to_vcs_root = true;
        };
      };
    };
  };
}
